app/controllers/admin/deputations_controller.rb

  def index
    if params[:conditions]
      @deputations = Deputation.find(:all,
        :conditions => params[:conditions],
        :order => 'date_start ASC'
      )
---
SELECT * FROM `deputations` WHERE (date_end >= CURRENT_DATE) ORDER BY date_start ASC