app/controllers/admin/ministers_controller.rb

  def index

    per_page = params[:pp] || 40

		if params[:sort] == 'active'
				@ministers = Minister.paginate_by_status 'active',
          :page => params[:page],
          :per_page => per_page,
          :order => 'lastname ASC'
		else
				@ministers = Minister.paginate :all,
          :page => params[:page],
          :per_page => per_page ,
          :order => 'lastname ASC'
---
SELECT * FROM `ministers` ORDER BY lastname ASC LIMIT 0, 16
SELECT count(*) AS count_all FROM `ministers`

  def show
    @minister = Minister.find(params[:id])
---
SELECT * FROM `ministers` WHERE (`ministers`.`id` = 111)