app/controllers/deputations_controller.rb

  def index

    if params[:conditions]
      @deputations = Deputation.find(:all,
        :conditions => params[:conditions],
        :order => 'date_start ASC',
        :limit => params[:l]|| 100
      )
---
SELECT * FROM `deputations` WHERE (date_end >= CURRENT_DATE) ORDER BY date_start ASC LIMIT 5

          'id'     => booking.id
        }
        if booking.church_id && booking.church_id > 0
          church = Church.find_by_id(booking.church_id)
---
SELECT * FROM `churches` WHERE (`churches`.`id` = 22) LIMIT 1